In [3]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass

In [4]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ···········

In [5]:
%%sql
select * from sakila.rental limit 3

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(1, datetime.datetime(2005, 5, 24, 22, 53, 30), 367, 130, datetime.datetime(2005, 5, 26, 22, 4, 30), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 15, 21, 30, 53))]

In [6]:
%%sql
-- 1 - Get number of monthly active customers

with customer_activity as (
  select customer_id, convert(rental_date, date) as Activity_date,
  date_format(convert(rental_date,date), '%Y') as Activity_year,
  date_format(convert(rental_date,date), '%M') as Activity_Month,
  date_format(convert(rental_date,date), '%m') as Activity_Month_Number
  from sakila.rental
)
select count(distinct customer_id) as Active_users, Activity_year, Activity_Month
from customer_activity
group by Activity_year, Activity_Month_Number
order by Activity_year, Activity_Month_Number

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(520, '2005', 'May'),
 (590, '2005', 'June'),
 (599, '2005', 'July'),
 (599, '2005', 'August'),
 (158, '2006', 'February')]